tzhen1/STM32/TempSensor/Core/Src/RADM_ports.c
//*--------------------------------------------------------------------------------------
//*                    RADM - Rotork Actuators Data acquisition Module
//*                         		(c) Synergy AST 2013
//*--------------------------------------------------------------------------------------
//* File Name           : RADM_ports.c
//* Object              : definition of MCU GPIOs
//* Creation            : Jiri Hofman 18/11/2013
//* Last modified       : Thomas Zhen 11/10/2021
//*--------------------------------------------------------------------------------------

//*--------------------------------------------------------------------------------------
//* Include external files
//*--------------------------------------------------------------------------------------
#include "stm32f4xx.h"
#include "stm32_hal_legacy.h"
//#include "stm32f4xx_gpio.h"
//#include "stm32f4xx_rcc.h"
#include "stm32f4xx_hal.h"
#include "RADM_system.h"
#include "RADM_ports.h"
#include "RADM_macros.h"


//*--------------------------------------------------------------------------------------
//* External References
//*--------------------------------------------------------------------------------------
//none

//*--------------------------------------------------------------------------------------
//* Definition of global variables
//* Directly controlled GPIOs port definition
//*--------------------------------------------------------------------------------------

GPIO_TypeDef* McuGpioPerDef[GPIO_LAST] =
{
	GPIOD, 	//PD12: DIS board Green LED LD4 [1 = activated]
	GPIOD, 	//PD13: DIS board Orange LED LD3 [1 = activated]
	GPIOD, 	//PD14: DIS board Red LED LD5 [1 = activated]
	GPIOD, 	//PD15: DIS board Blue LED LD6 [1 = activated]
//	GPIOA,	//PA0: Button [1 = activated] - user button disabled

	GPIOA,	//PA2: USART2 TX (Master command OUT)
	GPIOA,	//PA3: USART2 RX (Master command IN)
	GPIOA,	//PA1: USART2 RTS (Master command IN)
	GPIOA,	//PA0: USART2 CTS (Master command OUT)

	GPIOC,	//PC6: USART6 TX (ADAM command OUT)
	GPIOC,	//PC7: USART6 RX (ADAM command IN)
	GPIOE,	//PE4: RS485 DIR1 (USART6 to ADAM) [1 = RADM sends data]

	GPIOC,	//PC10: UART4 TX (RDPs command OUT)
	GPIOC,	//PC11: UART4 RX (RDPs command IN)
	GPIOE,	//PE2:  RS485 DIR2 (UART4 to RDPs) [1 = RADM sends data]
	GPIOE,	//PE6:  Alarm output [1 = activated]

	GPIOB,	//PB0: TIM3_CH3 (Generator PWM output)

	GPIOE,	//PE5: Panel DUAL LED red [1 = activated]
	GPIOE,  //PE3: Panel DUAL LED red [1 = activated]


	GPIOD,  //PD10: Actuator position switch 1 [0 = closed]
	GPIOD,	//PD8: 	Actuator position switch 2 [0 = closed]
	GPIOE,  //PE14: Actuator position switch 3 [0 = closed]
	GPIOE,  //PE12: Actuator position switch 4 [0 = closed]
	GPIOE,  //PE10: Actuator position switch 5 [0 = closed]


	GPIOC, 	//PC4: Synchronisation clock input [100 ms nominal]

	GPIOA	//PA8: Test pin for debug purposes
};

uint16_t McuGpioPinDef[GPIO_LAST] =
{
	GPIO_PIN_12,//PD12: DIS board Green LED LD4 [1 = activated]
	GPIO_PIN_13,//PD13: DIS board Orange LED LD3 [1 = activated]
	GPIO_PIN_14,//PD14: DIS board Red LED LD5 [1 = activated]
	GPIO_PIN_15,//PD15: DIS board Blue LED LD6 [1 = activated]
//	GPIO_Pin_0,	//PA0: Button [1 = activated] - user button disabled

	GPIO_PIN_2,	//PA2: USART2 TX (Master command OUT)
	GPIO_PIN_3,	//PA3: USART2 RX (Master command IN)
	GPIO_PIN_1,	//PA1: USART2 RTS (Master command IN)
	GPIO_PIN_0,	//PA0: USART2 CTS (Master command OUT)


	GPIO_PIN_6,	//PC6: USART6 TX (ADAM command OUT)
	GPIO_PIN_7,	//PC7: USART6 RX (ADAM command IN)
	GPIO_PIN_4,	//PE4: RS485 DIR1 (USART6 to ADAM) [1 = RADM sends data]

	GPIO_PIN_10,//PC10: UART4 TX (Slave command OUT)
	GPIO_PIN_11,//PC11: UART4 RX (Slave command IN)
	GPIO_PIN_2,	//PE2:  RS485 DIR2 (UART4 to RDPs) [1 = RADM sends data]
	GPIO_PIN_6,	//PE6:  Alarm output [1 = activated]

	GPIO_PIN_0,	//PB0: TIM3_CH3 (Generator PWM output)

	GPIO_PIN_5,	//PE5: Panel DUAL LED red [1 = activated]
	GPIO_PIN_3,	//PE3: Panel DUAL LED red [1 = activated]

	GPIO_PIN_10,//PD10: Actuator position switch 1 [0 = closed]
	GPIO_PIN_8,	//PD8: 	Actuator position switch 2 [0 = closed]
	GPIO_PIN_14,//PE14: Actuator position switch 3 [0 = closed]
	GPIO_PIN_12,//PE12: Actuator position switch 4 [0 = closed]
	GPIO_PIN_10,//PE10: Actuator position switch 5 [0 = closed]

	GPIO_PIN_4,	//PC4: Synchronisation clock input [100 ms nominal]

	GPIO_PIN_8	//PA8: Test pin for debug purposes
};

unsigned int ActuatorPosSwitches[NR_ACT_PS] = {
		APS1,		//PD10: Actuator position switch 1 [0 = closed]
		APS2,		//PD8: 	Actuator position switch 2 [0 = closed]
		APS3,		//PE14: Actuator position switch 3 [0 = closed]
		APS4,		//PE12: Actuator position switch 4 [0 = closed]
		APS5};		//PE10: Actuator position switch 5 [0 = closed]

//*--------------------------------------------------------------------------------------
//* Peripheral controlled GPIOs initialisation data TODO
//*--------------------------------------------------------------------------------------


//*--------------------------------------------------------------------------------------
//* Definition of local variables
//*--------------------------------------------------------------------------------------
//none


//*--------------------------------------------------------------------------------------
//* Function Name         : GpioInitialSetup
//* Object                : Initial setup of directly controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void GpioInitialSetup(void)
{
GPIO_InitTypeDef GPIO_InitStructure;

	//GPIO setup - enable clock to particular port gates
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);
//	__GPIOA_CLK_ENABLE();
//	__GPIOB_CLK_ENABLE();
//	__GPIOC_CLK_ENABLE();
//	__GPIOD_CLK_ENABLE();
//	__GPIOE_CLK_ENABLE();
//	__GPIOF_CLK_ENABLE();
//	__GPIOG_CLK_ENABLE();
//	__GPIOH_CLK_ENABLE();
//	__GPIOI_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOF_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();
	__HAL_RCC_GPIOI_CLK_ENABLE();

	//common attributes for LEDs
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;		//push-pull output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down

	GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;		//output mode
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down

	//LED_G port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[LED_G];
	HAL_GPIO_Init(McuGpioPerDef[LED_G], &GPIO_InitStructure);
	WriteToGpioPin(LED_G, 0);

	//LED_O port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[LED_O];
	HAL_GPIO_Init(McuGpioPerDef[LED_O], &GPIO_InitStructure);
	WriteToGpioPin(LED_O, 0);

	//LED_R port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[LED_R];
	HAL_GPIO_Init(McuGpioPerDef[LED_R], &GPIO_InitStructure);
	WriteToGpioPin(LED_R, 0);

	//LED_B port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[LED_B];
	HAL_GPIO_Init(McuGpioPerDef[LED_B], &GPIO_InitStructure);
	WriteToGpioPin(LED_B, 0);

	//PLED_R port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[PLED_R];
	HAL_GPIO_Init(McuGpioPerDef[PLED_R], &GPIO_InitStructure);
	WriteToGpioPin(PLED_R, 0);

	//PLED_G port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[PLED_G];
	HAL_GPIO_Init(McuGpioPerDef[PLED_G], &GPIO_InitStructure);
	WriteToGpioPin(PLED_G, 0);

