tzhen1/STM32/TempSensor/Core/Src/RADM_ports.c
	//TEST_PIN port setup - output mode
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[TEST_PIN];//TEST_PIN port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;		//push-pull output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;		//Pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[TEST_PIN], &GPIO_InitStructure);
//	WriteToGpioPin(TEST_PIN, 1);							//Initial state: logic high

GPIO_InitStructure.Pin   = McuGpioPinDef[TEST_PIN];//TEST_PIN port
GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;		//input mode
//GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
GPIO_InitStructure.Pull  = GPIO_PULLUP;		//Pull-up, no pull-down
HAL_GPIO_Init(McuGpioPerDef[TEST_PIN], &GPIO_InitStructure);


//	//BUTT port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[BUTT];//BUTT port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN;		//input mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;		//push-pull output type - N/A
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[BUTT], &GPIO_InitStructure);

	//common attributes for actuator switches inputs
	GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type - N/A
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
#ifdef SIMULATION_MODE
	GPIO_InitStructure.Pull  = GPIO_PULLUP;		//Pull-up, no pull-down
#else
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//no pull-up, no pull-down
#endif
	//APS1 port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[APS1];
	HAL_GPIO_Init(McuGpioPerDef[APS1], &GPIO_InitStructure);

	//APS2 port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[APS2];
	HAL_GPIO_Init(McuGpioPerDef[APS2], &GPIO_InitStructure);

	//APS3 port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[APS3];
	HAL_GPIO_Init(McuGpioPerDef[APS3], &GPIO_InitStructure);

	//APS4 port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[APS4];
	HAL_GPIO_Init(McuGpioPerDef[APS4], &GPIO_InitStructure);

	//APS5 port setup
	GPIO_InitStructure.Pin = McuGpioPinDef[APS5];
	HAL_GPIO_Init(McuGpioPerDef[APS5], &GPIO_InitStructure);

	//CLK_SYN port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[CLK_SYN];//CLK_SYN port
	GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;		//input mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//no pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[CLK_SYN], &GPIO_InitStructure);

	//ALARM port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[ALARM];//ALARM port
	GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[ALARM], &GPIO_InitStructure);
	WriteToGpioPin(ALARM, 0);						//Initial state: logic low - alarm muted
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Usart2GpioSetup
//* Object                : Setup of USART6 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Usart2GpioSetup(void)
{
GPIO_InitTypeDef GPIO_InitStructure;

	//USART2 remap to pins PC6 and PC7 , use .Alternate for HAL (PA2 and PA3 it meant i think)
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);

//GPIO_InitStructure.Alternate = GPIO_AF7_USART2;

	//USART2_TX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART2_TX];//USART2_TX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	GPIO_InitStructure.Alternate = GPIO_AF7_USART2;
	HAL_GPIO_Init(McuGpioPerDef[USART2_TX], &GPIO_InitStructure);

	//USART2_RX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART2_RX];//USART2_RX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	GPIO_InitStructure.Alternate = GPIO_AF7_USART2;
	HAL_GPIO_Init(McuGpioPerDef[USART2_RX], &GPIO_InitStructure);

	//USART2_RTS port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART2_RTS];//USART2_RTS port
	GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[USART2_RTS], &GPIO_InitStructure);

	//USART2_CTS port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART2_CTS];//USART2_CTS port
	GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[USART2_CTS], &GPIO_InitStructure);
	WriteToGpioPin(USART2_CTS, 1);						//initial state - logic high
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Usart3GpioSetup
//* Object                : Setup of USART3 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Usart3GpioSetup(void)
{
//GPIO_InitTypeDef GPIO_InitStructure;

//	//USART3 remap to pin PB10 and PB11
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_USART3);
//
//	//USART3_TX port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[USART3_TX];//USART3_TX port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;			//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;			//open-drain output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;		//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;		//no pull-up
//	GPIO_Init(McuGpioPerDef[USART3_TX], &GPIO_InitStructure);
//
//	//USART3_RX port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[USART3_RX];//USART3_RX port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;			//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;			//open-drain output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;		//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;		//no pull-up
//	GPIO_Init(McuGpioPerDef[USART3_RX], &GPIO_InitStructure);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Uart4GpioSetup
//* Object                : Setup of UART4 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Uart4GpioSetup(void)
{
GPIO_InitTypeDef GPIO_InitStructure;

