tzhen1/STM32/TempSensor/Core/Src/RADM_ports.c
	//UART4 remap to pin PC10 and PC11
//	GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
//	GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);

	//UART4_TX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[UART4_TX];//UART4_TX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;			//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;			//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;		//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;		//no pull-up
	GPIO_InitStructure.Alternate = GPIO_AF8_UART4;  /*  AF8  */
	HAL_GPIO_Init(McuGpioPerDef[UART4_TX], &GPIO_InitStructure);

	//UART4_RX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[UART4_RX];//UART4_TX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;			//Alternate function Mode
//	GPIO_InitStructure.OType = GPIO_OType_OD;			//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;		//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;		//no pull-up
	GPIO_InitStructure.Alternate = GPIO_AF8_UART4;
	HAL_GPIO_Init(McuGpioPerDef[UART4_RX], &GPIO_InitStructure);

	//RS485_DIR2 port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[RS485_DIR2];//RS485_DIR2 port
	GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;		//output mode
//	GPIO_InitStructure.OType = GPIO_OType_OD;		//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[RS485_DIR2], &GPIO_InitStructure);
	WriteToGpioPin(RS485_DIR2, 0);						//Initial state: logic low - RX mode
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Usart6GpioSetup
//* Object                : Setup of USART6 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Usart6GpioSetup(void)
{
GPIO_InitTypeDef GPIO_InitStructure;

	//USART6 remap to pins PC6 and PC7
//	GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6);
//	GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);


#ifdef MASTER_CMD_USART2
	//USART6_TX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART6_TX];//USART6_TX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	GPIO_InitStructure.Alternate = GPIO_AF8_USART6;
	HAL_GPIO_Init(McuGpioPerDef[USART6_TX], &GPIO_InitStructure);
#endif
#ifdef MASTER_CMD_USART6
	//USART6_TX port setup - port used master communication (debug)
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART6_TX];//USART6_TX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;		//push-pull output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_PULLUP;		//pull-up
	GPIO_InitStructure.Alternate = GPIO_AF8_USART6;
	HAL_GPIO_Init(McuGpioPerDef[USART6_TX], &GPIO_InitStructure);
#endif

	//USART6_RX port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[USART6_RX];//USART6_RX port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	GPIO_InitStructure.Alternate = GPIO_AF8_USART6;
	HAL_GPIO_Init(McuGpioPerDef[USART6_RX], &GPIO_InitStructure);

	//RS485_DIR1 port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[RS485_DIR1];//RS485_DIR1 port
	GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//No pull-up, no pull-down
	HAL_GPIO_Init(McuGpioPerDef[RS485_DIR1], &GPIO_InitStructure);
	WriteToGpioPin(RS485_DIR1, 0);						//Initial state: logic low - RX mode
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Tim3GpioSetup
//* Object                : Setup of TIM3 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Tim3GpioSetup(void)
{
GPIO_InitTypeDef GPIO_InitStructure;

	//USART6 remap to pins PB13 and PB15
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_TIM3); // PB0

	//GEN_OUT port setup
	GPIO_InitStructure.Pin   = McuGpioPinDef[GEN_OUT];//GEN_OUT port
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;		//push-pull output type
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIO_InitStructure.Pull  = GPIO_NOPULL;	//no pull-up
	GPIO_InitStructure.Alternate = GPIO_AF2_TIM3;
	HAL_GPIO_Init(McuGpioPerDef[GEN_OUT], &GPIO_InitStructure);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Tim4GpioSetup
//* Object                : Setup of TIM4 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Tim4GpioSetup(void)
{
//GPIO_InitTypeDef GPIO_InitStructure;
//
//	//GM_PULSES port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[GM_PULSES];	//GM_PULSES port
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;			//Top speed, could be reduced to save power
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;		//floating input type
//	GPIO_Init(McuGpioPerDef[GM_PULSES], &GPIO_InitStructure);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Spi1GpioSetup
//* Object                : Setup of SPI1 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Spi1GpioSetup(void)
{
//GPIO_InitTypeDef GPIO_InitStructure;

//	//SPI1 remap to pins PA4 to PA7
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource4, GPIO_AF_SPI1);	//SPI1_NSS
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_SPI1);	//SPI1_SCK
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_SPI1);	//SPI1_MISO
//	GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_SPI1);	//SPI1_MOSI
//
//	//SPI1_NSS port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI1_NSS];//SPI1_SCK port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI1_NSS], &GPIO_InitStructure);
//
//	//SPI1_SCK port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI1_SCK];//SPI1_SCK port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI1_SCK], &GPIO_InitStructure);
//
//	//SPI1_MISO port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI1_MISO];//SPI1_MISO port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI1_MISO], &GPIO_InitStructure);
//
//	//SPI1_MOSI port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI1_MOSI];//SPI1_MOSI port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//open-drain output type - N/A
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI1_MOSI], &GPIO_InitStructure);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Spi2GpioSetup
//* Object                : Setup of SPI2 controlled GPIOs - DAC interface
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

