tzhen1/STM32/TempSensor/Core/Src/RADM_ports.c
void Spi2GpioSetup(void)
{
//GPIO_InitTypeDef GPIO_InitStructure;

//	//SPI2 remap to pins PB13 and PB15
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_SPI2);	//SPI2_SCK
////	GPIO_PinAFConfig(GPIOB, GPIO_PinSource14, GPIO_AF_SPI2);	//SPI2_MISO - MISO not used for DAC
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource15, GPIO_AF_SPI2);	//SPI2_MOSI
//
//	//SPI2_SCK port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI2_SCK];//SPI2_SCK port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI2_SCK], &GPIO_InitStructure);
//
////	//SPI2_MISO port setup  - MISO not used for DAC
////	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI2_MISO];//SPI2_MOSI port
////	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
////	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type - N/A
////	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
////	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
////	GPIO_Init(McuGpioPerDef[SPI2_MISO], &GPIO_InitStructure);
//
//	//SPI2_MOSI port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[SPI2_MOSI];//SPI2_MOSI port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;		//Alternate function Mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[SPI2_MOSI], &GPIO_InitStructure);
//
//	//DAC_SYN port setup
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[DAC_SYN];//DAC_SYN port
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;		//output mode
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;		//push-pull output type
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//high speed on 30 pF (80 MHz Output max speed on 15 pF)
//	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;	//No pull-up, no pull-down
//	GPIO_Init(McuGpioPerDef[DAC_SYN], &GPIO_InitStructure);
//	WriteToGpioPin(DAC_SYN, 1);							//initial state - logic high

}
//*--------------------------------------------------------------------------------------
//* Function Name         : I2c1GpioSetup
//* Object                : Setup of I2C1 controlled GPIOs
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void I2c1GpioSetup(void)
{
//GPIO_InitTypeDef GPIO_InitStructure;
//
//	//I2C1 remap to PB8 and PB9
//	GPIO_PinRemapConfig(GPIO_Remap_I2C1,ENABLE);
//
//	//IR thermometer serial data clock input
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[I2C1_SCL];//I2C1_SCL port
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		//Top speed, could be reduced to save power
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;		//Alternate function output Open-drain type
////GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_OD;
//	GPIO_Init(McuGpioPerDef[I2C1_SCL], &GPIO_InitStructure);
//
//	//IR thermometer serial data input/output
//	GPIO_InitStructure.GPIO_Pin   = McuGpioPinDef[I2C1_SDA];//I2C1_SDA port
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		//Top speed, could be reduced to save power
//	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;		//Alternate function output Open-drain type
////GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_OD;
//	GPIO_Init(McuGpioPerDef[I2C1_SDA], &GPIO_InitStructure);
}
//*-------------------------------end of file RADM_ports.c---------------------------------


